So here's a simple example (I'm using Terraform v0.15.5, but doesn't seem specific to this) :
```
terraform {
  required_providers {
    aws = {
      source  = "hashicorp/aws"
      version = "~> 3.61"
    }
    assert = {
      source  = "bwoznicki/assert"
      version = "0.0.1"
    }
  }
}

provider "aws" {
  region  = "us-east-1"
}

resource "aws_iam_user" "test" {
  name = "some-random-username-for-testing"
}

data "assert_test" "just-a-test" {
  test  = aws_iam_user.test.arn == "foobar"
  throw = "The assert will always fail, but it needs to include an output from the aws resource"
}
```

Running an apply fails after creating the user: 
```
> terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.assert_test.just-a-test will be read during apply
  # (config refers to values not yet known)
 <= data "assert_test" "just-a-test"  {
      + id    = (known after apply)
      + test  = (known after apply)
      + throw = "The assert will always fail, but it needs to include an output from the aws resource"
    }

  # aws_iam_user.test will be created
  + resource "aws_iam_user" "test" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "some-random-username-for-testing"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_user.test: Creating...
aws_iam_user.test: Creation complete after 1s [id=some-random-username-for-testing]
data.assert_test.just-a-test: Reading...
╷
│ Error: The assert will always fail, but it needs to include an output from the aws resource
│
│   with data.assert_test.just-a-test,
│   on main.tf line 24, in data "assert_test" "just-a-test":
│   24: data "assert_test" "just-a-test" {
│
╵
```
```
> terraform destroy
aws_iam_user.test: Refreshing state... [id=some-random-username-for-testing]
╷
│ Error: The assert will always fail, but it needs to include an output from the aws resource
│
│   with data.assert_test.just-a-test,
│   on main.tf line 22, in data "assert_test" "just-a-test":
│   22: data "assert_test" "just-a-test" {
│
╵
```
I can see the user still exists and running a terraform refresh fails in the same way that the destroy does:
```
> terraform refresh
aws_iam_user.test: Refreshing state... [id=some-random-username-for-testing]
╷
│ Error: The assert will always fail, but it needs to include an output from the aws resource
│
│   with data.assert_test.just-a-test,
│   on main.tf line 24, in data "assert_test" "just-a-test":
│   24: data "assert_test" "just-a-test" {
│
╵
```